In [1]:
#  Q Replace True and False with 1 and 0

In [2]:
import pandas as pd

# Create a DataFrame with a column containing True and False values
data = {'T/F': [True, False, True, False, True]}

df = pd.DataFrame(data)

In [3]:
df

     T/F
0   True
1  False
2   True
3  False
4   True

In [4]:
df['New_Column'] = df['T/F'].apply(lambda x: 1 if x else 0)

# Display the DataFrame
df

     T/F  New_Column
0   True           1
1  False           0
2   True           1
3  False           0
4   True           1

In [5]:
# 2nd approch

df['new']= df['T/F'].astype(int)

In [6]:
df

     T/F  New_Column  new
0   True           1    1
1  False           0    0
2   True           1    1
3  False           0    0
4   True           1    1

In [7]:
# Qretrieve dataframe col names

In [8]:
df.columns

Index(['T/F', 'New_Column', 'new'], dtype='object')

In [9]:
for col in df.columns:
    print(col)

T/F
New_Column
new

In [10]:
#2nd approch
list(df.columns.values)

['T/F', 'New_Column', 'new']

In [11]:
# Q Find the row  no. for which a particualar col has max value

In [12]:
import pandas as pd

# Create a dictionary with student names and their scores
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Score': [85, 92, 78, 65, 88]
}

# Create a DataFrame from the dictionary
student_df = pd.DataFrame(data)

# Display the DataFrame
print(student_df)

      Name  Score
0    Alice     85
1      Bob     92
2  Charlie     78
3    David     65
4      Eva     88

In [13]:
student_df['Score'].idxmax()

1

In [14]:
# Q Find the row  for which a particualar col has max value

In [15]:
student_df.loc[student_df['Score'].idxmax()]

Name     Bob
Score     92
Name: 1, dtype: object

In [16]:
# Q select col of particular datatype

In [17]:
import pandas as pd

# Create a list of scores
scores = [90, 80, 70, 60]

# Create a list of names
names = ['John', 'Jane', 'Peter', 'Mary']

# Create a boolean column
is_passed = [True, False, True, False]

# Create a DataFrame
df = pd.DataFrame({'Score': scores, 'Name': names, 'Passed': is_passed})

In [18]:
df

   Score   Name  Passed
0     90   John    True
1     80   Jane   False
2     70  Peter    True
3     60   Mary   False

In [19]:
df.select_dtypes(include = ['bool'])

   Passed
0    True
1   False
2    True
3   False

Q How to check whether a pandas data frame is empty

In [21]:
df.empty

False

Q How to iterate over pandas row

In [26]:
for index,row in df.iterrows():
    print(index)
    print()
    print(row)
    break

0

Score       90
Name      John
Passed    True
Name: 0, dtype: object

In [27]:
for index,row in df.iterrows():
    print(index)
    print()
    print(row['Score'])
    break

0

90

In [28]:
for index,row in df.iterrows():
    print(df.loc[index])
    print()
    print(row)
    break

Score       90
Name      John
Passed    True
Name: 0, dtype: object

Score       90
Name      John
Passed    True
Name: 0, dtype: object

In [33]:
for index,row in df.iterrows():
    print(row['Score'],row['Name'])

90 John
80 Jane
70 Peter
60 Mary

isin()

In [42]:
df['Score'].isin([70,80])

0    False
1     True
2     True
3    False
Name: Score, dtype: bool

In [43]:
~df['Score'].isin([70,80]) # not in

0     True
1    False
2    False
3     True
Name: Score, dtype: bool

In [ ]:
# 28 pivot table understand